In [3]:
import pandas as pd

In [5]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
data = pd.DataFrame(x)

data

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [17]:
#Retrieve ID column
x = data[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [19]:
#Check type
type(x)

pandas.core.frame.DataFrame

In [23]:
# Access multiple data columns
z = data[['Department', 'Salary', 'ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [25]:
data.iloc[0,0]

'Rose'

In [29]:
# Access the value on the first row and the third column
data.iloc[0,2]

'Architect Group'

In [31]:
data.loc[0, 'Salary']

np.int64(100000)

In [33]:
data2 = data
data2 = data2.set_index("Name")

In [35]:
data2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [39]:
data2.loc['Jane', 'Salary']

np.int64(50000)

In [43]:
# do the slicing using old dataframe df
data.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [47]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
data.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [51]:
#let us do the slicing using loc() function on new dataframe df2 where index column is Name having labels: Rose, John and Jane
data2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team